._design_docs/.test_reports/mtp-jinja-run-20260607-V1/S12-MTP-B06-V1-Joriginal/hybrid/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\mtp-jinja-run-20260607-V1\S12-MTP-B06-V1-Joriginal\hybrid\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 23 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m01.0s/5m0s  00/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m02.0s), 1/2 VUs, 2 complete and 0 interrupted iterations
hit_probe   [   4% ] 1 VUs  0m02.0s/5m0s  01/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m03.0s), 1/2 VUs, 3 complete and 0 interrupted iterations
hit_probe   [   9% ] 1 VUs  0m03.0s/5m0s  02/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m04.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  13% ] 1 VUs  0m04.0s/5m0s  03/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m05.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
hit_probe   [  22% ] 1 VUs  0m05.0s/5m0s  05/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m06.0s), 1/2 VUs, 7 complete and 0 interrupted iterations
hit_probe   [  26% ] 1 VUs  0m06.0s/5m0s  06/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m07.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
hit_probe   [  30% ] 1 VUs  0m07.0s/5m0s  07/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m08.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  39% ] 1 VUs  0m08.0s/5m0s  09/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m09.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
hit_probe   [  43% ] 1 VUs  0m09.0s/5m0s  10/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m10.0s), 1/2 VUs, 12 complete and 0 interrupted iterations
hit_probe   [  48% ] 1 VUs  0m10.0s/5m0s  11/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m11.0s), 1/2 VUs, 13 complete and 0 interrupted iterations
hit_probe   [  52% ] 1 VUs  0m11.0s/5m0s  12/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m12.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
hit_probe   [  61% ] 1 VUs  0m12.0s/5m0s  14/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m13.0s), 1/2 VUs, 16 complete and 0 interrupted iterations
hit_probe   [  65% ] 1 VUs  0m13.0s/5m0s  15/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m14.0s), 1/2 VUs, 17 complete and 0 interrupted iterations
hit_probe   [  70% ] 1 VUs  0m14.0s/5m0s  16/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.0' rate=0.00%

    http_req_failed
    ✗ 'rate<0.01' rate=29.16%

    prefix_match_rate
    ✗ 'rate>=0.95' rate=69.56%


  █ TOTAL RESULTS 

    checks_total.......: 24     1.693001/s
    checks_succeeded...: 70.83% 17 out of 24
    checks_failed......: 29.16% 7 out of 24

    ✓ warmup 200
    ✗ probe 200
      ↳  69% — ✓ 16 / ✗ 7

    CUSTOM
    cache_hit_rate.................: 0.00%  0 out of 23
    cache_miss_prompt_ms...........: avg=270.23ms min=267.7ms  med=270.59ms p(95)=272.37ms max=273.86ms
    cache_n_tokens.................: avg=0        min=0        med=0        p(95)=0        max=0       
    prefix_match_rate..............: 69.56% 16 out of 23
    requests_ok....................: 17     1.199209/s

    HTTP
    http_req_duration..............: avg=552.85ms min=0s       med=690.16ms p(95)=703.41ms max=1.56s   
      { expected_response:true }...: avg=743.04ms min=685.55ms med=691.98ms p(95)=876.55ms max=1.56s   
    http_req_failed................: 29.16% 7 out of 24
    http_reqs......................: 24     1.693001/s

    EXECUTION
    iteration_duration.............: avg=628.43ms min=520.29µs med=790.31ms p(95)=889.71ms max=1.66s   
    iterations.....................: 24     1.693001/s
    vus............................: 1      min=1        max=1
    vus_max........................: 2      min=2        max=2

    NETWORK
    data_received..................: 31 kB  2.2 kB/s
    data_sent......................: 4.6 kB 325 B/s



running (0m14.2s), 0/2 VUs, 24 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m14.2s/5m0s  23/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters